PREFIXES = {
    'а', 'ан', 'анти', 'без', 'бес', 'благо', 'в', 'вз', 'вза', 'взо', 'во', 'воз', 'возо', 'вос', 'вс', 'все', 'вы',
    'диз', 'дис', 'до', 'ду', 'еже', 'из', 'изо', 'ино', 'ис', 'к', 'ка', 'ко', 'кое', 'меж', 'междо', 'между', 'мимо',
    'на', 'над', 'надо', 'наи', 'не', 'ни', 'низо', 'нис', 'о', 'об', 'обез', 'обес', 'обо', 'от', 'ото', 'па', 'пере',
    'перед', 'по', 'под', 'пода', 'подо', 'пра', 'пре', 'предо', 'при', 'про', 'проед', 'против', 'противо', 'раз',
    'разо', 'рас', 'роз', 'рос', 'с', 'со', 'среди', 'су', 'тре', 'у', 'эв', 'эпи'
}
